# Гра - вгадати число
#
# Програма-Гра намагаєтся за короткий період визничити число яке загадав користувач програми
# користувач загадує число від 0 до 100.  Программа намагається вгадати загадане число.
# Пропонуючи користувачу ймовірне число - очікує від нього що він чесно підтвердить що
# це число що програма питає:
# більше - якщо задумено користувачем число більше
# менше  - якщо задумане число менше
# так -  якщо число вгадане
# Якщо вгадано число - вивести яке число загадане і за скільки кроків це вдалося вгадати
# Якщо число не вгадане (користувач обманюав) - повідомити що користувач не честний

import random
user_number = int(input("Загадайте число від 0 до 100: "))
min_guess = 0
max_guess = 100
guess_count = 0
while True:
    guess = random.randint(min_guess, max_guess)
    guess_count += 1
    print(f"Чи це число {guess}?")
    user_response = input("Виберіть: 'більше', 'менше', 'так': ").lower()
    if user_response == 'більше':
        min_guess = guess + 1
    elif user_response == 'менше':
        max_guess = guess - 1
    elif user_response == 'так':
        if guess == user_number:
            print(f"Програма вгадала ваше число {user_number} за {guess_count} спроб")
            break
        else:
            print("Ви не чесні! Програма вгадала інше число.")
            break



