# Гра - вгадати число
#
# Програма-Гра намагаєтся за короткий період визничити число яке загадав користувач програми
# користувач загадує число від 0 до 100.  Программа намагається вгадати загадане число.
# Пропонуючи користувачу ймовірне число - очікує від нього що він чесно підтвердить що
# це число що програма питає:
# більше - якщо задумено користувачем число більше
# менше  - якщо задумане число менше
# так -  якщо число вгадане
# Якщо вгадано число - вивести яке число загадане і за скільки кроків це вдалося вгадати
# Якщо число не вгадане (користувач обманюав) - повідомити що користувач не честний

import random
numb_from_user = input("Загадайте число від 1 до 100")
min_numb = 0
max_numb = 100
count = 0
while True:
    number = random.randint(min_numb, max_numb)
    print(f"Ваше число {number}?")
    user = input("Виберіть: 'більше', 'менше', 'так': ")
    count += 1
    if user == 'більше':
        min_numb = number + 1
    elif user == 'менше':
        max_numb = number - 1
    elif user == 'так':
        if user == numb_from_user:
            print(f"Ваше число {number} було вгадано за {count} разів")
            break
        else:
            print("Ви граєте нечесно", '\N{angry face}')
            break




