# Напишіть програму, яка виводить квадратну матрицю розміру N на N.
# У кожному непарному рядку матриці йдуть числа від -N до -1, а в кожному парному — просто числа, що дорівнюють номеру цього рядка.
# N = запросити у користувача
# Вивести результат у вигляді матриці чисел.
# +2 бала до роботи якщо будете використовувати форматуваня так щоб числа які мають
# більше цифр не спотворювали візуальне представлення матриці.

n = int(input("Введіть число:  "))
matrix = [
    [
        (f"{(n*(-1)+j):3}" if i % 2 == 0 else f"{i+1:3}")
        for j in range(n)]
    for i in range(n)
]
for row in matrix:
    for element in row:
        print(element, end=" ")
    print()
