# Запросити у користувача ввести речення у якому більше 2х слів.
# Розділити речення на список рядків (використовуючи метод рядку split(" ") - де параметром вказано " ").
# Видалити елементи списку якщо вони містять пусті рядки.
# Відсортирувати рядки у списку.
# Вивести дані зі списку в 2 колонки де перша колонка це індекс писку а 2га колонка це елемент відсортированого списку.
# Вивести кількість слів .
#ви     знаєте    як   липа   шелестить  у місячні весняні ночі

string = (input("Напишіть перші дві строки улюбленого вірша: "))

string_split = string.split()
new_string = []

for word in string_split:
    if word: 
        new_string.append(word)

print("список без пропусків:", new_string)
new_string.sort()
print("відсортований список: ", new_string)

a = 0
for j in new_string:
    print(f"номер елементу {a+1:<3}", j)

print("Кількість cлів у списку:", len(new_string))






